{
  "name": "WK Overide",
  "latest_version": "1.1.1",
  "last_update": "2014-01-23",
  "author": "ruipgpinheiro",
  "contributors": "Beanow",
  "type": "usersript",
  "supported": "no",
  "status": "unsupported",
  "license": "GPLv3",
  "source_url": "https://gist.github.com/Beanow/9ea55a4d73d6156f01c9/raw/0f2f1da608b4713a8364122d7e88276c9b10b604/wko.user.js",
  "thread_url": "http://www.wanikani.com/chat/api-and-third-party-apps/2940",
  "homepage": "http://www.wanikani.com/chat/api-and-third-party-apps/2940",
  "screenshot_url": "https://s3.amazonaws.com/uso_ss/22462/large.jpg?1374622919",
  "description": "One of my biggest peeves with Wanikani is how once you get something wrong, you can't change it. If you type too fast and make a typo, or if the spell checker doesn't like you, you're out of luck. It's really frustrating to know an answer but have Wanikani deny it to you because it wants the '-ing' form of the verb, but you typed the infinitive. Sometimes you get lucky, and the spell checker is lenient enough to mark the answer correctly. Other times, that's not the case.\nThen,
there's the other type of mistakes. The ones where you type a reading but were supposed to type a meaning, or the opposite. Those are really annoying, since most times you actually knew the correct reading or meaning respectively.\n\nMy problem is that the decision was completely out of my hands. My objective is to learn Kanji, and I'm not going to cheat since that wouldn't bring me closer to where I want to be, but Wanikani decides that since some people could cheat if given the
chance, I can't be trusted and does not let me correct it when it is wrong.\n\n\nBut now, with the client-side reviews update, we can finally do something about all this!\n\n\nThis userscript fixes this problem, by adding an \"Ignore Answer\" button to the footer during reviews. This button can be clicked anytime an answer has been marked as wrong by Wanikani.\n\nOnce clicked, the current answer will be changed from \"incorrect\" (red background) to \"ignored\" (yellow background), and
Wanikani will forget you even answered it.\nThis way, the item will appear again later on during the review cycle, effectively giving you a second chance to get it right without stupid typos or the spell checker getting in the way.\n\nYou may also use '~' as a hotkey, instead of clicking the button."
}


